var a1=document.getElementById("t1");
		var a2=document.getElementById("t2");
		var b1=document.getElementById("b1");
		var t3=document.getElementById("t3");
		b1.onclick=function(){
		var a=["کابل","هرات","کندهار","پروان","کاپیسا","میدان وردک","لوگر","پنجشیر","بلخ","فاریاب","جوزجان","سمنگان","سرپل","پکتیا","پکتیکا","غزنی","خوست","ننگرهار","لغمان","کنر","فراه","غور","بادغیس","بدخشان","کندز","بغلان","تخار","هلمند","ارزگان","نیمروز","بامیان","نورستان","زابل","دایکندی"];
		var b=["کابل","هرات","کندهار","پروان","کاپیسا","میدان وردک","لوگر","پنجشیر","بلخ","فاریاب","جوزجان","سمنگان","سرپل","پکتیا","پکتیکا","غزنی","خوست","ننگرهار","لغمان","کنر","فراه","غور","بادغیس","بدخشان","کندز","بغلان","تخار","هلمند","ارزگان","نیمروز","بامیان","نورستان","زابل","دایکندی"];
		var c=[[0,816+"/"+4,497,114+"/"+6,102+"/"+2,123+"/"+8,78/1,166+"/"+2,444+"/"+8,717+"/"+6,566+"/"+5,317+"/"+3,608+"/"+9,138+"/"+9,200+"/"+9,148+"/"+9,230+"/"+3,197/1,147,232+"/"+3,907+"/"+8,451+"/"+6,833+"/"+7,377+"/"+6,355+"/"+4,221+"/"+3,364+"/"+6,692+"/"+6,470/1,956+"/"+2,181+"/"+7,"محاسبه نشده",1001,443],[816,0,572,788,892,745,868,"محاسبه نشده",708,434,617,841,476+"/"+1,920,975,809,1011,1008,958,1044,261,366,168,1171,896,922,961,455,730,469,677,1260,700,686],[496,572,0,599,592,489,466,"محاسبه نشده",1005,1003,985,802,892,438,405,350,540,688,638,724,414,703,737,862,820,706,849,198,163,462,597,"محاسبه نشده",131,489]];
		for(var i=0; i<a.length; i++){
			for(var j=0; j< b.length; j++){
				if((a1.value == a[i] && a2.value == b[j]) || (a2.value == a[i] && a1.value == b[j]) ){
				t3.value=c[i][j]+"KM"}}}}